# Adding & Removing Rows and Columns in Pandas

In [2]:
import pandas as pd

In [3]:
# Sample Titanic-like data
data = {
    "Name": ["Jack", "Rose", "Tom", "Ananda"],
    "Age": [22, 19, 25, 20],
    "Sex": ["male", "female", "male", "male"],
    "Survived": [1, 1, 0, 1],
    "Fare": [50, 100, 30, 60]
}

df = pd.DataFrame(data)
df

     Name  Age     Sex  Survived  Fare
0    Jack   22    male         1    50
1    Rose   19  female         1   100
2     Tom   25    male         0    30
3  Ananda   20    male         1    60

In [5]:
# Add a new column with default value
# Using .loc to add column
df.loc[:, "Embarked"] = "C"
df

     Name  Age     Sex  Survived  Fare Embarked
0    Jack   22    male         1    50        C
1    Rose   19  female         1   100        C
2     Tom   25    male         0    30        C
3  Ananda   20    male         1    60        C

In [ ]:
# Add a column based on calculation
df.loc[:, "Fare_after_tax"] = df["Fare"] * 1.10
df

In [ ]:
# Keep only selected columns using .loc
df = df.loc[:, ["Name", "Age", "Sex", "Survived", "Fare"]]
df

     Name  Age     Sex  Survived  Fare
0    Jack   22    male         1    50
1    Rose   19  female         1   100
2     Tom   25    male         0    30
3  Ananda   20    male         1    60

In [7]:
df

     Name  Age     Sex  Survived  Fare
0    Jack   22    male         1    50
1    Rose   19  female         1   100
2     Tom   25    male         0    30
3  Ananda   20    male         1    60

In [15]:
import numpy as np
df.loc[5] = ["Leo", 30, "male", np.nan, np.nan]

In [16]:
df.loc[5] = {"Name": "Leo", "Age": 30, "Sex": "male"}

for dictionary
Pandas will automatically fill missing columns with NaN.

This avoids having to remember the exact column order.